rottenpotatoes/app/controllers/movies_controller.rb

  def directors
    @movie = Movie.find params[:id]
    if @movie.director.blank?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Nolan'

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "director" = 'George Lucas', "release_date" = '2006-05-25 00:00:00.000000', "updated_at" = '2016-04-06 18:25:47.108290' WHERE "movies"."id" = 21